<?php
//header("content-Type: text/html; charset=latin1"); 	
$conn = mysql_connect("localhost","huge_f","huge12345") or die("connect failed");

mysql_select_db("huge");

mysql_query("set names utf8");


$sql = "INSERT INTO `yy_goods` (`goods_name`, `goods_code`, `category_id`, `unit`, `price`, `tax`, `description`, `stock`, `operator_id`, `operator`, `create_time`, `update_time`, `is_show`, `is_delete`) VALUES
('中国豆腐A', 'zgdf1', 4, '斤', 1, 5, '国产', 95, 1, '曹政', '2017-09-08 23:19:25', '2017-09-08 23:19:25', 0, 0),
('日本豆腐A', 'rbdf1', 4, '斤', 2, 10, '日本产', 55, 1, '曹政', '2017-09-08 23:20:09', '2017-09-08 23:20:09', 0, 0),
('甜豆浆A', 'tdj1', 5, '杯', 1, 1, '豆类饮料', 100, 1, '曹政', '2017-09-08 23:20:57', '2017-09-08 23:20:57', 0, 0),
('咸豆浆A', 'xdj1', 5, '杯', 2, 1, '添加盐等调味品', 15, 1, '曹政', '2017-09-08 23:21:49', '2017-09-08 23:21:49', 0, 0),
('原味豆浆A', 'ywdj1', 5, '杯', 1, 1, '原汁原味的新鲜豆浆', 300, 1, '曹政', '2017-09-08 23:22:33', '2017-09-08 23:22:33', 0, 0),('中国豆腐B', 'zgdf2', 4, '斤', 1, 5, '国产', 95, 1, '曹政', '2017-09-08 23:19:25', '2017-09-08 23:19:25', 0, 0),
('日本豆腐B', 'rbdf2', 4, '斤', 2, 10, '日本产', 55, 1, '曹政', '2017-09-08 23:20:09', '2017-09-08 23:20:09', 0, 0),
('甜豆浆B', 'tdj2', 5, '杯', 1, 1, '豆类饮料', 100, 1, '曹政', '2017-09-08 23:20:57', '2017-09-08 23:20:57', 0, 0),
('咸豆浆B', 'xdj2', 5, '杯', 2, 1, '添加盐等调味品', 15, 1, '曹政', '2017-09-08 23:21:49', '2017-09-08 23:21:49', 0, 0),
('原味豆浆B', 'ywdj2', 5, '杯', 1, 1, '原汁原味的新鲜豆浆', 300, 1, '曹政', '2017-09-08 23:22:33', '2017-09-08 23:22:33', 0, 0),('中国豆腐C', 'zgdf3', 4, '斤', 1, 5, '国产', 95, 1, '曹政', '2017-09-08 23:19:25', '2017-09-08 23:19:25', 0, 0),
('日本豆腐C', 'rbdf3', 4, '斤', 2, 10, '日本产', 55, 1, '曹政', '2017-09-08 23:20:09', '2017-09-08 23:20:09', 0, 0),
('甜豆浆C', 'tdj3', 5, '杯', 1, 1, '豆类饮料', 100, 1, '曹政', '2017-09-08 23:20:57', '2017-09-08 23:20:57', 0, 0),
('咸豆浆C', 'xdj3', 5, '杯', 2, 1, '添加盐等调味品', 15, 1, '曹政', '2017-09-08 23:21:49', '2017-09-08 23:21:49', 0, 0),
('原味豆浆C', 'ywdj3', 5, '杯', 1, 1, '原汁原味的新鲜豆浆', 300, 1, '曹政', '2017-09-08 23:22:33', '2017-09-08 23:22:33', 0, 0),
('龙虾A', 'zgdf4', 9, '斤', 1, 5, '国产', 95, 1, '曹政', '2017-09-08 23:19:25', '2017-09-08 23:19:25', 0, 0),
('小黄鱼A', 'rbdf4', 9, '斤', 2, 10, '日本产', 55, 1, '曹政', '2017-09-08 23:20:09', '2017-09-08 23:20:09', 0, 0),
('鲨鱼A', 'tdj4', 9, '杯', 1, 1, '豆类饮料', 100, 1, '曹政', '2017-09-08 23:20:57', '2017-09-08 23:20:57', 0, 0),
('秋刀鱼A', 'xdj4', 9, '杯', 2, 1, '添加盐等调味品', 15, 1, '曹政', '2017-09-08 23:21:49', '2017-09-08 23:21:49', 0, 0),
('乌贼A', 'ywdj4', 8, '杯', 1, 1, '原汁原味的新鲜豆浆', 300, 1, '曹政', '2017-09-08 23:22:33', '2017-09-08 23:22:33', 0, 0)";
try{
	$res = mysql_query($sql);
}
catch(exception $e)
{
	echo $e->getMessage();
}

var_dump($res);
//$sql = "select * from hg_region limit 0,10";
/*
$sql = "select * from yy_category WHERE deepth = 2";


$result = mysql_query($sql);
$list = array();
while($row = mysql_fetch_assoc($result))
{
	$list[] = $row;
	
}

exit(json_encode($list));
//print_r($list);
